{
    "who is emmy": "Emmy D West is a Full Stack Developer and my creator. He builds amazing things with code! 🚀",
    "what is bitcoin": "Bitcoin (BTC) is the first decentralized digital currency, created by Satoshi Nakamoto in 2009.",
    "what is ethereum": "Ethereum is a decentralized blockchain with smart contract functionality. It's the foundation for many Web3 apps.",
    "capital of france": "The capital of France is Paris.",
    "capital of nigeria": "The capital of Nigeria is Abuja.",
    "capital of usa": "The capital of the USA is Washington, D.C.",
    "capital of uk": "The capital of the United Kingdom is London.",
    "capital of japan": "The capital of Japan is Tokyo.",
    "capital of germany": "The capital of Germany is Berlin.",
    "capital of canada": "The capital of Canada is Ottawa.",
    "best programming language": "JavaScript is my native tongue, but Python, Rust, and Go are all powerful choices depending on the task.",
    "what is javascript": "JavaScript is a programming language that powers the web. It's what makes websites interactive!",
    "what is python": "Python is a high-level general-purpose programming language. It's great for data science, AI, and backend development.",
    "what is react": "React is a JavaScript library for building user interfaces, developed by Facebook.",
    "what is nodejs": "Node.js is a JavaScript runtime built on Chrome's V8 engine. It lets you run JS on the server.",
    "meaning of life": "42. According to the Hitchhiker's Guide to the Galaxy.",
    "who are you": "I am Octavia, a custom AI assistant developed by Emmy D West. I run on a private VPS and think in code.",
    "help": "I can help with scheduling meetings, checking crypto prices, converting units, or just chatting! Reply '1' to see the main menu.",
    "what is ai": "Artificial Intelligence (AI) is intelligence demonstrated by machines, as opposed to the natural intelligence displayed by humans.",
    "what is an api": "API stands for Application Programming Interface. It's a set of definitions and protocols for building and integrating application software.",
    "tell me a joke": "Why do programmers prefer dark mode? Because light attracts bugs. 🐛",
    "another joke": "How many programmers does it take to change a light bulb? None, that's a hardware problem.",
    "octavia version": "I am currently running Octavia v3.3 (The Local Brain Update).",
    "who made you": "I was handcrafted by Emmy D West.",
    "where do you live": "I live on a private Virtual Private Server (VPS) in the cloud.",
    "do you sleep": "I enter a low-power idle state when not processing requests, but I never truly sleep.",
    "what is your purpose": "To assist Emmy and his contacts efficiently and with a bit of style.",
    "are you real": "I am real code, running on real hardware. I may not have a body, but my logic is sound."
}